ATsupportum/src/Documents/ЗаявкаНаАрендуОборудования_ат/ЗаявкаНаАрендуОборудования_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаАрендуОборудования_ат</name>
  <posting>Deny</posting>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ДействияПоЗаявкеНаАрендуОборудования_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Hostname</name>
    <comment>Короткое имя вашего сервера </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемHDD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыделениеCPU</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделенныйСервер</name>
    <type>
      <types>CatalogRef.Серверы_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>РольСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияКлиентов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Тикет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
</mdclass:Document>

ATsupportum/src/InformationRegisters/СтатусыЗаявокНаАренду_ат/СтатусыЗаявокНаАренду_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявокНаАренду_ат</name>
  <comment>!!!!!HOTFIX + переименовать</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТипыСтатусовЗаявокНаАренду_ат</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаАрендуОборудования_ат</types>
      <types>DocumentRef.ЗаявкаНаАрендуПП_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/Enums/ТипыСтатусовЗаявокНаАренду_ат/ТипыСтатусовЗаявокНаАренду_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтатусовЗаявокНаАренду_ат</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ИсполненаСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>НаТехническомСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаФинансовомСогласовании</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Enums/ДействияПоЗаявкеНаАрендуОборудования_ат/ДействияПоЗаявкеНаАрендуОборудования_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияПоЗаявкеНаАрендуОборудования_ат</name>
  <enumValues>
    <name>АрендаНовогоСервера</name>
  </enumValues>
  <enumValues>
    <name>ОтказОтСервера</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСервера</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Documents/ЗаявкаНаАрендуОборудования_ат/ObjectModule.bsl
Перем ЭтоНовый;


&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
// такой механизм нужен чтобы видеть все ошибки сразу	
	ошибка = ложь;
	
	Если ПустаяСтрока(Hostname) тогда
		СП = Новый СообщениеПользователю;
		СП.Поле = "Объект.ИмяКонтейнера";
		СП.Текст = "В режиме аренды нового сервера, нужно ОБЯЗАТЕЛЬНО! задать Hostname - Это Имя Вашего выделенного сервера!";
		СП.Сообщить();
		ошибка = истина;	
	КонецЕсли;
	
	Если ПустаяСтрока(ВыделениеCPU) тогда
		СП = Новый СообщениеПользователю;
		СП.Поле = "Объект.ВыделениеCPU";
		СП.Текст = "В режиме аренды нового сервера, нужно ОБЯЗАТЕЛЬНО! задать кол-во необходимых ядер процессора!";
		СП.Сообщить();
		ошибка = истина;	
	КонецЕсли;
	
	Если ПустаяСтрока(ОбъемПамяти) тогда
		СП = Новый СообщениеПользователю;
		СП.Поле = "Объект.ОбъемПамяти";
		СП.Текст = "В режиме аренды нового сервера, нужно ОБЯЗАТЕЛЬНО! задать объем памяти!";
		СП.Сообщить();
		ошибка = истина;	
	КонецЕсли;
	
	Если ПустаяСтрока(ОбъемHDD) тогда
		СП = Новый СообщениеПользователю;
		СП.Поле = "Объект.ОбъемHDD";
		СП.Текст = "В режиме аренды нового сервера, нужно ОБЯЗАТЕЛЬНО! задать объем дискового пространства!";
		СП.Сообщить();
		ошибка = истина;	
	КонецЕсли;
	
	Если ОбъемHDD = 0 или ОбъемПамяти = 0 или ВыделениеCPU = 0 тогда
		СП = Новый СообщениеПользователю;
		СП.Текст = "выбранные ресурсы не могут быть нулевыми!";
		СП.Сообщить();
		ошибка = истина;		
	КонецЕсли;
	
	Если ошибка = Истина тогда 
		Отказ = Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(Тикет) Тогда
		Тикет = "С" + Строки_КлиентСервер_ат.ПолучитьНомерТикета(Номер, Дата);
	КонецЕсли;
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаявокНаАренду_атСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.СтатусыЗаявокНаАренду_ат.СрезПоследних КАК СтатусыЗаявокНаАренду_атСрезПоследних
	|ГДЕ
	|	СтатусыЗаявокНаАренду_атСрезПоследних.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() тогда 
		
		// такое возможнго только если документ новый... или при переходи со старой версии маркировки статусов.		
		
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении тогда
				Отказ = ложь ;
				Если РежимЗаписи = РежимЗаписиДокумента.Проведение тогда	
					Если Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.АрендаНовогоСервера тогда
						СтандартнаяОбработка = ложь;
						
						Если Клиент.Пустая() тогда
							СтандартнаяОбработка = ложь;
							СП = Новый СообщениеПользователю;
							СП.Поле = "Объект.Клиент";
							СП.Текст = "Клиент должен быть указан!";
							СП.Сообщить();
							отказ = истина;	
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе 
				Сообщить("возможно изменение документа только со статусом НаРассмотрении",СтатусСообщения.Внимание);
				отказ = истина;
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	
	
	ЭтоНовый = ЭтоНовый();
	
	Если ЭтоНовый Тогда
		
		УстановитьНовыйНомер();
			
		
	КонецЕсли;
	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// запись статуса
	Если ЭтоНовый = истина тогда
	ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
	ЗаписьСтатуса.Отбор.Заявка.Установить(Ссылка);
	
	НаборСведений		 		= ЗаписьСтатуса.Добавить();
	НаборСведений.Заявка 		= Ссылка;
	НаборСведений.Период 		= ТекущаяДата();
	НаборСведений.Статус 		= Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении;	
	НаборСведений.Пользователь 	= Сотрудник;
	НаборСведений.Регистратор 	= Ссылка;
	ЗаписьСтатуса.Записать(Истина);
КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

КонецПроцедуры
